# Data Preprocessing Tools

## Importing the libraries

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

## Importing the dataset

In [3]:
df = pd.read_csv('../Data.csv')
x = df.iloc[:,:-1].values  # Select all the rows and all columns beside the last one
y = df.iloc[:,-1].values   # Select all the rows and the last column only
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
print(f'x=  {x}\n\n')
print(f'y=  {y}')

x=  [['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 nan]
 ['France' 35.0 58000.0]
 ['Spain' nan 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]


y=  ['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

## Taking care of missing data

In [5]:
#Showing missing values
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [6]:
# Drop missing values in pandas and resetting the index
df.dropna().reset_index()

   index  Country   Age   Salary Purchased
0      0   France  44.0  72000.0        No
1      1    Spain  27.0  48000.0       Yes
2      2  Germany  30.0  54000.0        No
3      3    Spain  38.0  61000.0        No
4      5   France  35.0  58000.0       Yes
5      7   France  48.0  79000.0       Yes
6      8  Germany  50.0  83000.0        No
7      9   France  37.0  67000.0       Yes

In [7]:
# Changing the missing values with mean for one column in a pandas dataframe 
df['Age'].fillna(df['Age'].mean())

0    44.000000
1    27.000000
2    30.000000
3    38.000000
4    40.000000
5    35.000000
6    38.777778
7    48.000000
8    50.000000
9    37.000000
Name: Age, dtype: float64

In [8]:
#Changing the missing value with the mean for each column
df.fillna(df.mean())

C:\Users\RTHNEI~1\AppData\Local\Temp/ipykernel_12240/4103381701.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [16]:
# Using SKlearn for filling the missing values with the mean of the coulmn used for numpy arrays

from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
x[:,1:3]=imputer.fit_transform(x[:,1:3])

## Encoding categorical data

### Encoding the Independent Variable

### Encoding the Dependent Variable

## Splitting the dataset into the Training set and Test set

## Feature Scaling